links.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no" />
    <meta name="generator" content="cl-yag" />
    <title>Paco Pascal's Writings</title>
    <link rel="stylesheet" type="text/css" href="static/css/style.css" media="screen" />
    <link rel="alternate" type="application/rss+xml" title="Paco Pascal's Writings RSS Feed" href="rss.xml" />
<!--    <link rel="alternate" type="application/rss+xml" title="Paco Pascal's Writings RSS Feed Gopher" href="rss-gopher.xml" /> -->
<!--    <link rel="alternate" type="application/atom+xml" title="Paco Pascal's Writings Atom Feed" href="atom.xml" /> -->
    <link rel="icon" type="image/x-icon" href="static/img/clyagFav.ico" />
  </head>

  <body>

    <div id="wrapper">
      <header>
	<nav class="pure-menu pure-menu-horizontal">
	  <!--<a href="#"></a>-->
	    <ul class="pure-menu-list">
	      <li class="pure-menu-item"><a href="index.html" class="pure-menu-link">Index</a></li>
	      <li class="pure-menu-item"><a href="index-titles.html" class="pure-menu-link">All Posts</a></li>
	      <li class="pure-menu-item"><a href="links.html" class="pure-menu-link">Links</a></li>
	      <li class="pure-menu-item"><a href="rss.xml" class="pure-menu-link">RSS</a></li>
	     </ul>
	</nav>
	<div>All Tags: </div>
      </header>

      <main>
<div id="outline-container-orgb7a4f49" class="outline-2">
<h2 id="orgb7a4f49">Links</h2>
<div class="outline-text-2" id="text-orgb7a4f49">
<p>
Because search engines are broken, here's a collection of links that I
find interesting and/or useful.
</p>
</div>


<div id="outline-container-orge3ffb6c" class="outline-3">
<h3 id="orge3ffb6c">Individual Person Sites</h3>
<div class="outline-text-3" id="text-orge3ffb6c">
<ul class="org-ul">
<li><a href="http://wandel.ca/">Markus Wandel</a> &#x2014; He's an engineer with other hobbies. The website
hasn't been updated since 2009, but it's still worth looking at. I
found this guy's site over 10 years ago. The first page I read was
about his <a href="http://wandel.ca/homepage/pbx.html">homemade PBX</a> (which
I recommend reading).</li>
<li><a href="https://wozniak.ca/">Geoff Wozniak</a> &#x2014; A small but interesting programmer's blog.</li>
<li><a href="https://nullprogram.com/">null program: Chris Wellons</a> &#x2014; This blog belongs to a programmer
and is all about programming. His posts are technical and
interesting with C being a favorite topic of his.</li>
<li><a href="http://www.azillionmonkeys.com">Paul Hsieh</a> &#x2014; This is an older site that's no longer updated but
still worth looking at; especially if you're interested in assembly
programming.</li>
<li><a href="https://www.vttoth.com/CMS/">Viktor T. Toth</a> &#x2014; A career programmer who's life passion is physics.</li>
<li><a href="https://www.devdungeon.com/">DevDungeon</a> &#x2014; A blog and more by John Daniel Leon. The primary
topics here are related programming, cybersecurity, software
freedom, and electronics.</li>
<li><a href="https://derivativedribble.wordpress.com/">Charles Davi</a> &#x2014; He's a mathematician that worked in financial
services for eight years, most recently at BlackRock, spending a
significant portion of his free time conducting research in
information theory. His posts are often controversial, but his work
might be worth taking a look at.</li>
<li><a href="http://findsomethingandburnit.com/">Jim Vicious</a> &#x2014; An eccentric mad scientist type character with too
many projects in the works including an "armored and weaponized
zombie apocalypse pyrate beast" truck.</li>
<li><a href="https://augusterdwilliamsjr.com/">Auguster D Williams Jr</a> &#x2014; Mixed Media Artist, US Navy Veteran,
chess enthusiast and friend.</li>
</ul>
</div>
</div>

<div id="outline-container-org3b201b2" class="outline-3">
<h3 id="org3b201b2">Cooking &amp; Food</h3>
<div class="outline-text-3" id="text-org3b201b2">
<ul class="org-ul">
<li><a href="https://based.cooking/">Based Cooking</a> &#x2014; A clean simple recipe directory with no ads created
by <a href="https://lukesmith.xyz/">Luke Smith</a>.</li>
<li><a href="https://web.archive.org/web/20020205023717/http://www.geocities.com/Tokyo/1721/martha4.html">Martha Stewart's Cobbler Dough</a> &#x2014; Originally found on geocities, I've
used this recipe many times.</li>
<li><a href="http://www.manjulaskitchen.com/">Manjula's Kitchen</a> &#x2014; Straight from the source: "Manjula is here to
teach you simple and practical recipes that carry out the
authenticity of Indian vegetarian cooking."</li>
</ul>
</div>
</div>

<div id="outline-container-org67f379a" class="outline-3">
<h3 id="org67f379a">Physics</h3>
<div class="outline-text-3" id="text-org67f379a">
<ul class="org-ul">
<li><a href="https://webspace.science.uu.nl/~gadda001/goodtheorist/index.html">How to become a GOOD Theoretical Physicist</a></li>
<li><a href="https://www.susanjfowler.com/blog/2016/8/26/from-the-fledgling-physicist-archives-if-susan-can-learn-physics-so-can-you">If Susan Can Learn Physics, So Can You</a></li>
<li><a href="https://www.susanrigetti.com/physics">So You Want to Learn Physics</a></li>
<li><a href="http://www.coultersmithing.com/forums/index.php">Coulter Smithing: Science/Engineering/Technical forums</a> &#x2014; These
forums are meant to foster a community, and build up useful
information for all to read and learn from. The intent is to stick
primarily to practical, hands-on, experiential knowledge in most of
the forums here, in other words, things that teach someone else what
you know.</li>
</ul>
</div>
</div>

<div id="outline-container-org828b441" class="outline-3">
<h3 id="org828b441">Mathematics</h3>
<div class="outline-text-3" id="text-org828b441">
<ul class="org-ul">
<li><a href="http://math.mit.edu/~cohn/Thoughts/advice.html">Advice for amateur mathematicians on writing and publishing papers</a>
&#x2014; From the source: There's no reason why amateurs can't make
worthwhile research contributions in mathematics. It has happened
many times in the past, and I know of several cases today. I don't
have time to offer a lot of personal advice and guidance, but I
figured I'd post some general advice here. I've aimed it at people
who think they've already solved famous problems, since those are
the sort that typically write, but it should be equally useful for
people with more modest aspirations. I focus on the mechanics of how
to do literature searches, write papers, and publish them, because I
have less to say about the deeper issue of how to do research. None
of this advice is specific to amateurs, but professionals already
learn all these things from their advisors.</li>
<li><a href="http://www.openproblemgarden.org/">Open Problem Garden</a> &#x2014; A collection of open (unsolved) problems in
mathematics.</li>
<li><a href="https://www.math.purdue.edu/pow/">Purdue's Problem of the Week</a> &#x2014; Weekly math problems to solve.</li>
</ul>
</div>
</div>

<div id="outline-container-org65fbf05" class="outline-3">
<h3 id="org65fbf05">Computer Security / Hacking</h3>
<div class="outline-text-3" id="text-org65fbf05">
<ul class="org-ul">
<li><a href="https://overthewire.org/">Over The Wire</a> &#x2014; This site has been around forever. It has a good
collection of wargames.</li>
<li><a href="https://cwe.mitre.org/index.html">Common Weakness Enumeration (CWE)</a> &#x2014; CWE™ is a community-developed
list of software and hardware weakness types. It serves as a common
language, a measuring stick for security tools, and as a baseline
for weakness identification, mitigation, and prevention efforts.</li>
<li><a href="https://www.wechall.net/">We Chall</a> &#x2014; For the people not familiar with challenge sites, a
challenge site is mainly a site focused on offering
computer-related problems. Users can register at such a site and
start solving challenges. There exist lots of different challenge
types. The most common ones are the following: Cryptographic,
Crackit, Steganography, Programming, Logic and Math/Science. The
difficulty of these challenges vary as well.</li>
</ul>
</div>
</div>

<div id="outline-container-orga57e8d4" class="outline-3">
<h3 id="orga57e8d4">Utilities</h3>
<div class="outline-text-3" id="text-orga57e8d4">
<ul class="org-ul">
<li><a href="http://surusu.com/">SuRuSu</a> &#x2014; A flash card replacement similar to Anki.</li>
<li><a href="https://www.upcdatabase.com/">UPC Database</a> &#x2014; A crowd sourced database of UPC (and more) barcodes.</li>
</ul>
</div>
</div>

<div id="outline-container-org2ee8c4d" class="outline-3">
<h3 id="org2ee8c4d">World Affairs</h3>
<div class="outline-text-3" id="text-org2ee8c4d">
<ul class="org-ul">
<li><a href="http://cryptome.org/">Cryptome</a> &#x2014; Before WikiLeaks there was cryptome, but no one knew.</li>
</ul>

<p>
More to be added &#x2026;
</p>
</div>
</div>
</div>
  </main>

<!--      <footer><p></p></footer> -->

    </div><!-- #wrapper -->

    <script id="MathJax-script" async
	    src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-chtml.js">
    </script>
  </body>
</html>
